{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "layer": {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_max_pooling2d", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_conv2d_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_max_pooling2d_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_conv2d_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_max_pooling2d_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_flatten", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dropout", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 0, "end_step": 2000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d/mask", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d/threshold", "shape": [], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d/pruning_step", "shape": [], "dtype": "int32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_1/mask", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_1/threshold", "shape": [], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_1/pruning_step", "shape": [], "dtype": "int32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_2/mask", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_2/threshold", "shape": [], "dtype": "float32"}, {"name": "prune_low_magnitude_conv2d_2/pruning_step", "shape": [], "dtype": "int32"}, {"name": "dense/kernel", "shape": [4608, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "prune_low_magnitude_dense/mask", "shape": [4608, 512], "dtype": "float32"}, {"name": "prune_low_magnitude_dense/threshold", "shape": [], "dtype": "float32"}, {"name": "prune_low_magnitude_dense/pruning_step", "shape": [], "dtype": "int32"}, {"name": "dense_1/kernel", "shape": [512, 4], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4], "dtype": "float32"}, {"name": "prune_low_magnitude_dense_1/mask", "shape": [512, 4], "dtype": "float32"}, {"name": "prune_low_magnitude_dense_1/threshold", "shape": [], "dtype": "float32"}, {"name": "prune_low_magnitude_dense_1/pruning_step", "shape": [], "dtype": "int32"}, {"name": "prune_low_magnitude_dropout/pruning_step", "shape": [], "dtype": "int32"}, {"name": "prune_low_magnitude_flatten/pruning_step", "shape": [], "dtype": "int32"}, {"name": "prune_low_magnitude_max_pooling2d/pruning_step", "shape": [], "dtype": "int32"}, {"name": "prune_low_magnitude_max_pooling2d_1/pruning_step", "shape": [], "dtype": "int32"}, {"name": "prune_low_magnitude_max_pooling2d_2/pruning_step", "shape": [], "dtype": "int32"}]}]}